#pragma once
#include "Math/Vector2.h"
#include "Math/Vector3.h"

///-------------------------------------------/// 
/// AABBの構造体
///-------------------------------------------///
struct AABB {
    Vector3 min; //!<最小点
    Vector3 max; //!<最大点
};

///-------------------------------------------/// 
/// OBBの構造体
///-------------------------------------------///
struct OBB {
    Vector3 center;          // !<中心
    Vector3 axis[3];         // !<座標軸。正規化・直交必須
    Vector3 halfSize;        // !<座標軸方向の長さの半分。中心空面までの距離
};

///-------------------------------------------/// 
/// Sphereの構造体
///-------------------------------------------///
struct Sphere {
    Vector3 center;  // 中心
    float radius;    // 半径
};